ravynsoft/ravynos/Kernel/Extensions/IOUSBFamily/include/IOKit/usb/IOUSBControllerV2.h
    OSMetaClassDeclareReservedUsed(IOUSBControllerV2,  25);
	/*!
	 @function openPipe
	 Open a pipe to the specified device endpoint
	 @param address Address of the device on the USB bus
	 @param speed of the device: kUSBDeviceSpeedLow, kUSBDeviceSpeedFull, kUSBDeviceSpeedHigh or kUSBDeviceSpeedSuper
	 @param endpoint description of endpoint to connect to
	 @param maxStreams maximum number of streams pipe supports
	 @param maxBurstAndMult maximum number of bursts and burst multiplier
	 */
	virtual IOReturn 		OpenSSPipe(USBDeviceAddress 	address,
									   UInt8				speed,
									   Endpoint *			endpoint,
									   UInt32				maxStreams,
									   UInt32				maxBurstAndMult);
    
	OSMetaClassDeclareReservedUsed(IOUSBControllerV2,  26);
	/*!
	 @function UpdateDeviceAddress
	 Tell the controller about the new address of a device. Used when a device has been reset
	 @param deviceAddress Address of the device on the USB bus
	 @param speed of the device: kUSBDeviceSpeedLow, kUSBDeviceSpeedFull, kUSBDeviceSpeedHigh or kUSBDeviceSpeedSuper
     @param highSpeedHub    If non zero, this is a full speed device, the address of the high speed hub to address split transactions to.
     @param highSpeedPort   If highSpeedHub is non zero, the hub port to address split transactions to
	 */
    virtual IOReturn 		UpdateDeviceAddress(USBDeviceAddress oldDeviceAddress,
                              USBDeviceAddress newDeviceAddress,
                              UInt8 speed,
                              USBDeviceAddress hubAddress,
                              int port);

    
    
	OSMetaClassDeclareReservedUnused(IOUSBControllerV2,  27);
    OSMetaClassDeclareReservedUnused(IOUSBControllerV2,  28);
    OSMetaClassDeclareReservedUnused(IOUSBControllerV2,  29);
    
};


#endif
